IDEA StatiCa Open Model
TendonBar Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The TendonBar type exposes the following members.
Properties
Name | Description
Id
 Tendon Id
Material
 Material
NumStrandsInTendon
 number of ropes in tendon
Phase
 Phase
Point
 Position of bar
PrestressingOrder
 order of tendon prestessing
PrestressReinforcementType
 set of prestress reinforcement type
TendonDuct
 Tendon duct
TendonType
 Tendon type
Top
See Also
Reference
TendonBar Class
IdeaRS.OpenModel.CrossSection Namespace